src/config/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/СтавкиНДС/Ext/ManagerModule.bsl
// Определяет ставки НДС, операции, отражение по которым, подлежат регистрации в книге продаж.
//
// Параметры:
//   Параметры - Структура - параметры для определения ставок
//     * ВерсияПостановленияНДС1137 - Число - см. УчетНДС.ВерсияПостановленияНДС1137.
//
// Возвращаемое значение:
//   Массив - ставки НДС
Функция СтавкиПоОперациямОтражаемымВКнигеПродаж(ВерсияПостановленияНДС1137) Экспорт
	
	МассивСтавок = Новый Массив;
	
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС0);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	Если ВерсияПостановленияНДС1137 < 3 Тогда
		МассивСтавок.Добавить(Перечисления.СтавкиНДС.БезНДС);
	КонецЕсли;
	
	Возврат МассивСтавок;
	
КонецФункции
